// Объявление базового родительского объекта смотри в листинге 1.
// Объявление DancingSeries смотри в листинге 2.
// Конструктор объекта робот-пылесос Samba смотри в листинге 13.

// Создадим робот пылесосSamba.
const Samba6 = new Samba(101);

// Попробуем обратиться к стандартному методу toString, хоть мы его и не объявляли ни в одном из объектов.
console.log(Samba6.toString()); // [object Object]

// Хоть мы и не объявляли метод toString в нашей цепочки объектов, но он присутствует и идёт от самого первого объекта (базового), т.к. его прототип - это сам объект Object, и метод toString пришел от него.

// Создадим пустой объект без прототипа.
const Samba7 = Object.create(null);

// Попробуем обратиться к стандартному методу toString и посмотреть на свойство __proto__
console.log(Samba7.toString); // undefined
console.log(Samba7.__proto__); // undefined
